<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.uoe-macos.jss.AdobePhotoshopCC2018</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobePhotoshopCC2018</string>
		<key>ccpinfo</key>
		<dict>
			<key>Language</key>
			<string>en_GB</string>
			<key>Products</key>
			<array>
				<dict>
					<key>baseVersion</key>
					<string>19.0</string>
					<key>sapCode</key>
					<string>PHSP</string>
					<key>version</key>
					<string>latest</string>
				</dict>
			</array>
			<key>adminPrivilegesEnabled</key>
			<true/>
			<key>appsPanelEnabled</key>
			<false/>
			<key>customerType</key>
			<string>enterprise</string>
			<key>matchOSLanguage</key>
			<true/>
			<key>organizationName</key>
			<string>Edinburgh College of Art</string>
			<key>rumEnabled</key>
			<true/>
			<key>updatesEnabled</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.uoe-macos.jss.flatpkg.Adobe.CreativeCloudApp</string>
	<key>Process</key>
	<array>
	</array>
</dict>
</plist>
