<policy>
	<general>
		<name>Install %PROD_NAME%</name>
		<enabled>true</enabled>
		<frequency>Ongoing</frequency>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	 	<trigger>EVENT</trigger>
        	<trigger_other>app-adobecc2018</trigger_other>
	</general>
	<scope>
		<!--Scope added by JSSImporter-->
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
	</package_configuration>
	<scripts>
		<!--Scripts added by JSSImporter-->
	</scripts>
	<self_service>
		<use_for_self_service>false</use_for_self_service>
	</self_service>
	<maintenance>
		<recon>true</recon>
	</maintenance>
</policy>
