<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Install Pro Tools 2018.7</string>
	<key>Identifier</key>
	<string>com.github.uoe-macos.pkg.ProTools2018</string>
	<key>Input</key>
	<dict>
		<key>VERSION</key>
                <string>2018.7</string>
		<key>RELEASE</key>
		<string>1</string>
		<key>ID</key>
		<key>com.github.uoe-macos.pkg.ProTools2018.pkg</key>
		<key>NAME</key>
		<string>ProTools2018</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
         		<key>Processor</key>
         		<string>PackageRequired</string>
         	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>	
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/%NAME%.pkg</string>
				<key>overwrite</key>
				<true/>
				<key>source_pkg</key>
				<string>%PKG%</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash
echo "################ INSTALLING PRO TOOLS #################"
installer -target / -pkg ./%NAME%.pkg
echo "################ INSTALLED PRO TOOLS ##################"
echo "################ RUNNING POSTINSTALL FIXES ###############"
# from Neil Martin's guide:
# http://www.pro-tools-expert.com/home-page/2014/1/29/preparing-pro-tools-forautomatic-installation-in-a-mac-enter.html

# Adapted by Tim for PT 12.4
SHOETOOL_NAME="com.avid.bsd.shoetoolv120"
PHT_SHOE="/Library/PrivilegedHelperTools/$SHOETOOL_NAME"
PLIST="/Library/LaunchDaemons/$SHOETOOL_NAME.plist"

# Copy the com.avid.bsd.shoetoolv120 Helper Tool

/bin/cp -f "/Applications/Pro Tools.app/Contents/Library/LaunchServices/$SHOETOOL_NAME" $PHT_SHOE
/usr/sbin/chown root:wheel $PHT_SHOE
/bin/chmod 544 $PHT_SHOE
 
# Create the Launch Deamon Plist for com.avid.bsd.shoe

rm -f $PLIST # In case Pro Tools has been updated from a previous version
 
/usr/libexec/PlistBuddy -c "Add Label string" $PLIST
/usr/libexec/PlistBuddy -c "Set Label $SHOETOOL_NAME" $PLIST
 
/usr/libexec/PlistBuddy -c "Add MachServices dict" $PLIST
/usr/libexec/PlistBuddy -c "Add MachServices:$SHOETOOL_NAME bool" $PLIST
/usr/libexec/PlistBuddy -c "Set MachServices:$SHOETOOL_NAME true" $PLIST
 
/usr/libexec/PlistBuddy -c "Add ProgramArguments array" $PLIST
/usr/libexec/PlistBuddy -c "Add ProgramArguments:0 string" $PLIST
/usr/libexec/PlistBuddy -c "Set ProgramArguments:0 $PHT_SHOE" $PLIST
 
/bin/launchctl load $PLIST

# added in from Media Composer 8.5.x, make the Avid Application Manager as quiet as possible
rm /Library/LaunchAgents/com.avid.ApplicationManager.plist
defaults write /Library/Preferences/com.avid.Application\ Manager enterpriseMode -bool true
defaults write /Library/Preferences/com.avid.Application\ Manager showAppNotifications -bool false
defaults write /Library/Preferences/com.avid.Application\ Manager showFeedsNotifications -bool false
echo "###################### DONE #####################"
exit 0 
</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array/>
					<key>id</key>
					<string>%ID%</string>
					<key>pkgname</key>
					<string>%NAME%-%VERSION%-%RELEASE%</string>
		<!--
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
		-->
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%VERSION%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/Scripts/%NAME%.pkg</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
