<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package Wwise Interactive Audio Engine</string>
    <key>Identifier</key>
    <string>com.github.uoe-macos.pkg.wwise</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Wwise</string>
        <key>VERSION</key>
        <string/>
        <key>EMAIL</key>
        <string></string>
        <key>PASSWORD</key>
        <string></string>
        <key>INSTALL_STYLE</key>
        <string>mini</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>        
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/wwise_pkg_root</string>
                <key>pkgdirs</key>
                <dict/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>WwiseInstallProvider</string>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%VERSION%</string>
                <key>install_prefix</key>
                <string>%RECIPE_CACHE_DIR%/wwise_pkg_root</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/wwise_pkg_root</string>
                    <key>id</key>
                    <string>com.audiokinetik.pkg.wwise</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>