<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package the Unlocker tool for Bute Loudness Suite - Surround</string>
    <key>Identifier</key>
    <string>com.github.autopkg.pkg.bute_loudness_surround_unlocker</string>
    <key>Input</key>
    <dict>
        <key>VERSION</key>
        <string>latest</string>
        <key>NAME</key>
        <string>ButeLoudnessSuiteSurroundUnlocker</string>
        <key>DOWNLOAD_NAME</key>
        <string>Unlocker</string>
        <key>VERSION</key>
        <string>1.3.1</string>
        <key>LICENSE_KEY</key>
        <string>THisIsATest</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
		<key>url</key>
		<string>http://www.signumaudio.com/distributables/%DOWNLOAD_NAME%.zip</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts</string>
                <key>source_path</key>
                <string>%RECIPE_DIR%/Scripts</string>
                <key>overwrite</key>
		<true/>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Unlocker</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/Unlocker</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
                <key>file_mode</key>
                <string>0755</string>
                <key>file_content</key>
                <string>#!/bin/sh
chmod +x Unlocker
echo "Running unlocker for Bute Loudness Suite Surround"
./Unlocker --licenseKey %LICENSE_KEY%
if [ $? == 0 ]
then
    mv /var/root/Library/Application\ Support/ButeLoudnessSuiteSurround/ButeLoudnessSuiteSurround.key\
       /Library/Application\ Support/ButeLoudnessSuiteSurround/
else
    echo "Failed"
    exit 1
fi
		</string>
            </dict>
            <key>Processor</key>
            <string>FileCreator</string>
         </dict>
	 <dict>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%VERSION%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgroot</key>
                    <string>pkgroot</string>
		    <key>version</key>
                    <string>%VERSION%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>com.signumaudio.buteloudnesssuite-surround-unlocker</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>Scripts</string>
                </dict>
            </dict>
        </dict>
	<dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
