<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Bute Loudness Suite - Surround</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.bute_loudness_surround</string>
    <key>Input</key>
    <dict>
        <key>VERSION</key>
        <string>AUTO</string>
        <key>NAME</key>
        <string>ButeLoudnessSuiteSurround</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.signumaudio.com/downloads/butesuitesurround.html</string>
                <key>re_pattern</key>
                <string>Download for Mac&lt;br&gt;&lt;br&gt;\s*&lt;a href="../distributables/ButeLoudnessSuiteSurroundMac([0-9\.]+)\.pkg.zip"&gt;</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
		        <key>url</key>
		        <string>http://www.signumaudio.com/distributables/%NAME%Mac%version%.pkg.zip</string>
                <key>filename</key>
                <string>%NAME%-%VERSION%.pkg.zip</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.pkg.zip</string>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
